OpenFOAM-6-cantera-openmpi/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/0/topAir/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/topAir";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    minX
    {
        type            fixedValue;
        value           $internalField;
    }
    maxX
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    "(min|max)(Y|Z)"
    {
        type            zeroGradient;
        value           $internalField;
    }
    "topAir_to_.*"
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
}


// ************************************************************************* //
